Revit 2027 API
AnalysisDisplayColorEntry.IsEqual Method
 Compare color entries.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsEqual(
	AnalysisDisplayColorEntry other
)
Public Function IsEqual (
	other As AnalysisDisplayColorEntry
) As Boolean
public:
bool IsEqual(
	AnalysisDisplayColorEntry^ other
)
member IsEqual :
        other : AnalysisDisplayColorEntry -> bool
Parameters
other AnalysisDisplayColorEntry
 Color entry to compare to.
Return Value
Boolean
 True if color entries are equal, false otherwise.
See Also
Reference
AnalysisDisplayColorEntry Class
Autodesk.Revit.DB.Analysis Namespace